const faqs = [
  {
    id: 1,
    question: "რა არის პროგრამირება?",
    answer:
      "პროგრამირება არის ინსტრუქციების ნაკრების შექმნის პროცესი, რომელიც მიუთითებს კომპიუტერს, როგორ უნდა შეასრულოს მოცემული დავალება.",
  },
  {
    id: 2,
    question: "რატომ შეიქმნა ქართული პროგრამირების ენა?",
    answer:
      "ენას მიზანია პროგრამირება გასაგები და მარტივად აღსაქმელი იყოს ქართველი ხალხისთვის, ინგლისური ენის ცოდნის გარეშე.",
  },
  {
    id: 3,
    question: "რით განსხვავდება ენა სხვა პროგრამირების ენებისგან?",
    answer:
      "ენას აქვს საკუთარი სტრუქტურა, სინტაქსი, და საკვანძო სიტყვები რომლებიც შექმნილია ქართულად, თუმცა მას აქვს საბაზისო პროგრამირების ენის მახასიათებლები, რომლებიც გვხვდება სხვა გავრცელებულ ენებში.",
  },
  {
    id: 5,
    question:
      "შემიძლია თუ არა ამ ენის გამოყენება რეალური აპლიკაციების შესაქმნელად?",
    answer:
      "ენა ძირითადად საგანმანათლებლო მიზანს ემსახურება, ამიტომ არ აქვს გარკვეული მახასიათებლები, რომლებიც აქვთ ინდუსტრიულ პროგრამირების ენებს.",
  },
  {
    id: 6,
    question:
      "არის თუ არა რაიმე ჯგუფი, სადაც შემიძლია კითხვების დასმა და სხვა მოსწავლეებთან ურთიერთობა?",
    answer:
      "დიახ, ჩვენ გვაქვს დისკორდის სერვერი, სადაც შეგიძლიათ დაუკავშირდეთ სხვა მოსწავლეებს, დასვათ შეკითხვები, გააზიაროთ თქვენი პროექტები და ისწავლოთ სხვების გამოცდილებიდან.",
  },
  {
    id: 8,
    question: "რა მიმართულებით უნდა განვაგრძო სწავლა ქართული პროგრამირების ენის საფუძვლების გაცნობის შემდეგ?",
    answer:
      "ენის საფუძვლების გაცნობის შემდეგ შეგიძლიათ შეისწავლოთ თემები, როგორებიცაა: ობიექტზე ორიენტირებული პროგრამირება, მონაცემთა სტრუქტურები, ალგორითმები, ფაილების დამუშავება და სხვა.",
  },
];

export function FAQ() {
  return (
    <div className="bg-white bg-gradient-to-b from-white via-nord6-100 to-slate-50">
      <div className="mx-auto max-w-7xl px-6 py-16 sm:py-24 lg:px-8">
        <h2 className="text-2xl font-bold leading-10 tracking-tight text-gray-900">
          ხშირად დასმული კითხვები
        </h2>
        <p className="mt-6 max-w-2xl text-base leading-7 text-gray-600">
        დამატებითი კითხვების შემთხვევაში, დამიკავშირდით{" "}
          <a
            href="mailto:pgagnidze@ena-lang.org"
            className="font-semibold text-nord9-100 hover:text-nord9-200"
          >
            მეილზე
          </a>{" "}
        </p>
        <div className="mt-20">
          <dl className="space-y-16 sm:grid sm:grid-cols-2 sm:gap-x-6 sm:gap-y-16 sm:space-y-0 lg:grid-cols-3 lg:gap-x-10">
            {faqs.map((faq) => (
              <div key={faq.id}>
                <dt className="text-base font-semibold leading-7 text-gray-900">
                  {faq.question}
                </dt>
                <dd className="mt-2 text-base leading-7 text-gray-600">
                  {faq.answer}
                </dd>
              </div>
            ))}
          </dl>
        </div>
      </div>
    </div>
  );
}
