const faqs = [
  {
    id: 1,
    question: "რა არის პროგრამირება და რატომ უნდა ვისწავლო?",
    answer:
      "პროგრამირება არის ინსტრუქციების ნაკრების შექმნის პროცესი, რომელიც ეუბნება კომპიუტერს როგორ თუ როგორ უნდა შეასრულოს მოცემული დავალება. პროგრამირების სწავლა გვეხმარება პრობლემის გადაჭრაში აპლიკაციების შექმნისას, და ციფრული სამყაროს უკეთ გააზრებაში.",
  },
  {
    id: 2,
    question: "რატომ შეიქმნა ქართული პროგრამული ენა?",
    answer:
      "ქართული პროგრამირების ენა შეიქმნა, რომ კოდირება უფრო ხელმისაწვდომი და ინტუიციური ყოფილიყო ქართველებისთვის. ეს ენა დამწყებებს აძლევს საშუალებას, რომ ისწავლონ პროგრამირება მშობლიური ენის გამოყენებით.",
  },
  {
    id: 3,
    question: "რით განსხვავდება ენა სხვა პროგრამირების ენებისგან?",
    answer:
      "ეს ენა უნიკალურია, რადგან ის მორგებულია ქართული ენისთვის. ენის სინტაქსი, საკვანძო სიტყვები და სტრუქტურა შექმნილია ქართულად.",
  },
  {
    id: 5,
    question:
      "შემიძლია თუ არა ამ ენის გამოყენება რეალური აპლიკაციების შესაქმნელად?",
    answer:
      "ეს ენა შექმნილია იმისთვის, რომ დაგეხმაროთ რეალურ სამყაროში პროექტების შემუშავებაში. თუმცა, რადგან ენა ძირითადად საგანმანათლებლოა, შეიძლება არ ჰქონდეს გარკვეული მახასიათებლები, რომლებიც აქვთ სხვა ინდუსტრიულ პროგრამირების ენებს.",
  },
  {
    id: 6,
    question:
      "არის თუ არა რაიმე ჯგუფი, სადაც შემიძლია კითხვების დასმა და სხვა მოსწავლეებთან ურთიერთობა?",
    answer:
      "დიახ, გვაქვს დისკორდის სერვერი ჩვენს ვებსაიტზე, სადაც შეგიძლიათ დაუკავშირდეთ სხვა მოსწავლეებს, დასვათ შეკითხვები, გააზიაროთ თქვენი პროექტები და ისწავლოთ სხვების გამოცდილებიდან.",
  },
  {
    id: 8,
    question: "რა თემები უნდა ვისწავლო შემდეგ საფუძვლების გააზრების შემდეგ?",
    answer:
      "საფუძვლების გაცნობის შემდეგ, შეგიძლიათ შეისწავლოთ თემები, როგორიცაა ობიექტზე ორიენტირებული პროგრამირება, მონაცემთა სტრუქტურები, ალგორითმები, ფაილების დამუშავება და სხვა.",
  },
];

export function FAQ() {
  return (
    <div className="bg-white bg-gradient-to-b from-white via-nord6-100 to-slate-50">
      <div className="mx-auto max-w-7xl px-6 py-16 sm:py-24 lg:px-8">
        <h2 className="text-2xl font-bold leading-10 tracking-tight text-gray-900">
          ხშირად დასმული კითხვები
        </h2>
        <p className="mt-6 max-w-2xl text-base leading-7 text-gray-600">
          თუ გაქვთ დამატებითი შეკითხვები, გთხოვთ დამიკავშირდეთ{" "}
          <a
            href="mailto:pgagnidze@ena-lang.org"
            className="font-semibold text-nord9-100 hover:text-nord9-200"
          >
            ამ მეილზე
          </a>{" "}
          და დაგიბრუნდებით რაც შეიძლება მალე.
        </p>
        <div className="mt-20">
          <dl className="space-y-16 sm:grid sm:grid-cols-2 sm:gap-x-6 sm:gap-y-16 sm:space-y-0 lg:grid-cols-3 lg:gap-x-10">
            {faqs.map((faq) => (
              <div key={faq.id}>
                <dt className="text-base font-semibold leading-7 text-gray-900">
                  {faq.question}
                </dt>
                <dd className="mt-2 text-base leading-7 text-gray-600">
                  {faq.answer}
                </dd>
              </div>
            ))}
          </dl>
        </div>
      </div>
    </div>
  );
}
